'''
Домашнє завдання після 7го уроку:
Порахувати складений відсоток для депозиту.
Умови:
- Відсоток завжди складений (нарахований відсоток кожного місяця додається до сумми вкладу)
- На відсоток накладаються податок у 18% та військовий збір 1,5%
- Кожного місяця можна поповнювати сумму вкладу на будь яку суму, але ми рахуємо з постійним стабільним поповнюванням
Результат:
- Скільки зароблено кожного місяця, скільки всього було вкладено, скільки всього було зароблено.

Вхідні дані:
- яка початкова сума?
- скільки місяців термін?
- скільки відсоток?
- скільки ми додаємо щомісяця?
Приклади:

15 місяців, 15 відсотків, 25 тис. грн, 25 тис грн кожного місяця.
'''
sum_poch = int(input('яка початкова сума?'))
month_vklad = int(input('скільки місяців термін?'))
vidsotku = float(input('скільки відсоток?'))
sum_month =  int(input('скільки ми додаємо щомісяця?'))
sum_doh = 0
s_month_vklad = 0
sum_doh_kin = 0
for mo in range(1,sum_month+1):
    sum_doh = sum_poch*vidsotku/1200
    sum_pdfo = sum_doh*0.18
    sum_vz = sum_doh*0.015
    sum_doh_kin = sum_doh -  sum_pdfo - sum_vz
    if mo == 1  or mo == sum_month:
        sum_poch += sum_doh_kin + month_vklad*0
    else:
        sum_poch += sum_doh_kin + month_vklad
    s_month_vklad += month_vklad

    print(mo, int(sum_doh), int(sum_doh_kin), int(sum_poch))




