# Третій рівень ("Містер Буль. Джордж Буль!"): Розвʼязати задачу: Задача fizz-buzz:
# Ви маєте три числа, вони вводяться з консолі. Перше число називається fizz,
# друге називається buzz. До третього необхідно дорахувати від одиниці.
# Дивлячись на поточне число, якщо воно кратне fizz – треба виводити F замість числа.
# Якщо число кратне buzz – треба виводити B замість числа. Якщо число кратне і fizz, і buzz,
# треба виводити FB. Якщо воно не кратне нічому, виводимо число. І так -
# поки не буде досягнуто третього введеного числа.
# Приклад умови та результату: Введено числа 2, 5, 18
# Висновок має бути таким: 1 F 3 F B F 7 F 9 FB 11 F 13 F B F 17 F
a = int(input('Input 1st number:  '))
b = int(input('Input 2nd number:  '))
c = int(input('Input 3d numbers, must be maximum:  '))
if a > c or b > c:
    c = int(input('Input 3d numbers, must be maximum:  '))
answ = ''
for el in range(1, c+1):
    if el % (a*b) == 0:
        answ += 'FB '
    elif el % a == 0:
        answ += 'F '
    elif el % b == 0:
        answ += 'B '
    else:
        answ += str(el) + ' '
print(answ)





